import streamlit as st
import random

# ---------------------------
# Вопросы с поддержкой LaTeX и нескольких ответов
# ---------------------------
questions = [
    {
        "question": "Формула y = A * e^(-a * x^2) сәйкес келетін қисық аты қандай?",
        "options": [
            "Туынды қатенің қисығы", "Гаусс қатенің қисығы", "Бөлшектік қатенің қисығы",
            "Салыстырмалы қатенің қисығы", "Абсолют қатенің қисығы", "Джоуль қатенің қисығы",
            "Ньютон қатенің қисығы", "Резерфорд қатенің қисығы"
        ],
        "correct": ["Гаусс қатенің қисығы"]
    },
    {
        "question": "Гаусс категориясындағы A тұрақтысын α арқылы өрнекте:",
        "latex": r"\int_{-\infty}^{+\infty} e^{-\alpha x^2} dx = 1",
        "options": [
            "A = √(α / 6π)", "A = √(α / 2π)", "A = √(α / 8π)",
            "A = √(α / 3π)", "A = √(α / 4π)", "A = √(α / π)"
        ],
        "correct": ["A = √(α / π)"]
    },
    {
        "question": "Нақты газдағы α және b түзетулердің өлшем бірлігі қандай?",
        "options": [
            "[a] = Па·м³ / моль, [b] = м³ / моль",
            "[a] = Па·м¹² / моль³, [b] = м⁶ / ммоль",
            "[a] = Па·м¹² / моль³, [b] = м³ / моль³",
            "[a] = Па·м⁶ / моль², [b] = м³ / моль",
            "[a] = Па·м⁶ / моль², [b] = 1 / моль",
            "[a] = Па·м⁶ / моль², [b] = м⁶ / ммоль"
        ],
        "correct": ["[a] = Па·м⁶ / моль², [b] = м³ / моль"]
    },
    {
        "question": "Реперлік нүкте температурасы қандай?",
        "options": [
            "273,16 градус", "473,16 градус", "277,16 градус",
            "273,96 градус", "275,16 градус", "373,16 градус",
            "289,16 градус", "278,16 градус"
        ],
        "correct": ["273,16 градус"]
    },
    {
        "question": "Жылу машинасының ПӘК формуласы қандай?",
        "options": [
            "η = Q₁ / A", "η = Q₂Q₁ / Q₁", "η = (T₁ − T₂) / T₁",
            "η = A / Q₁", "η = (Q₁ − Q₂) / Q₁", "η = (T₁ + T₂) / T₁"
        ],
        "correct": ["η = (T₁ − T₂) / T₁"]
    },
    {
        "question": "Қалыпты қысымда, 0°C температурада 1 см³ ауадағы молекула саны қанша?",
        "options": [
            "0,27 * 10²⁰", "27 * 10¹⁸", "6,7 * 10¹⁹",
            "2,7 * 10¹⁹", "627 * 10²⁰", "67 * 10¹⁸", "6,27 * 10²⁰"
        ],
        "correct": ["2,7 * 10¹⁹"]
    },
    {
        "question": "Термодинамикалық потенциалдар (Каноникалық күй теңдеулері): қай теңдеу дұрыс?",
        "options": [
            "I = I(W, Q)", "Ψ = Ψ(V, T, S)", "I = I(S, P)",
            "U = U(Q, T)", "U = U(P, S, V)", "Ψ = Ψ(T, S)",
            "U = U(P, S, T, Y)", "U = U(S, V)"
        ],
        "correct": ["Ψ = Ψ(V, T, S)"]
    },
    {
        "question": "Жүйеге dQ жылу берілгенде оның температурасының dT-ға өзгергендегі жылусыйымдылығы C неге тең?",
        "options": [
            "C = δQ / dT × dT", "C = δQ × dT", "C = δQ − dT",
            "C = dT − δQ", "C = δQ + dT", "C = δQ / dT", "C = dT / δQ"
        ],
        "correct": ["C = δQ / dT"]
    },
    {
        "question": "Авогадро санының өрнегі қандай?",
        "options": [
            "Nₐ = R / k", "Nₐ = 2k / R", "Nₐ = k / R",
            "Nₐ = 2R / 5k", "Nₐ = c / k", "Nₐ = 5 / k", "Nₐ = 2R / k"
        ],
        "correct": ["Nₐ = R / k"]
    },
    {
        "question": "Төменнен жоғары ұшып бара жатқан молекулалар беретін қозғалыс саны үшін дұрыс өрнек қандай?",
        "latex": r"G_+ = \frac{1}{3} n \vartheta g_0 + \frac{1}{6} n \vartheta \lambda \frac{dg}{dx}",
        "options": [
            "G₊ = 1/7 nϑg₀ + 1/6 nϑλ dg/dx",
            "G₊ = 1/6 nϑg₀ − 1/6 nϑλ dg/dx",
            "G₊ = 1/3 nϑg₀ + 1/6 nϑλ dg/dx",
            "G₊ = 1/5 nϑg₀ × 1/6 nϑλ dg/dx",
            "G₊ = 1/4 nϑg₀ + 1/6 nϑθλ dg/dx",
            "G₊ = 1/2 nϑg₀ − 1/6 nϑθλ dg/dx"
        ],
        "correct": ["G₊ = 1/3 nϑg₀ + 1/6 nϑλ dg/dx"]
    },
{
    "question": "Ван-дер-Ваальс теңдеуіндегі критикалық шама байланысын көрсететін қатынастар",
    "options": [
        "Vk = 3a/R",
        "Vk = 3/b",
        "pk = b²a / 7",
        "pk = a / 27b²",
        "Tk = a / R",
        "Vk = 3b",
        "Tk = 8a / 27Rb"
    ],
    "correct": ["pk = a / 27b²", "Vk = 3b", "Tk = 8a / 27Rb"]
},
{
    "question": "θ = (2/3) * ε / k тұрақты формуласы арқылы анықталатын θ шамасының атауы",
    "latex": r"\theta = \frac{2}{3} \cdot \frac{\varepsilon}{k}",
    "options": [
        "тұрақты температура", "Авогадро температурасы", "ғарыштық температура",
        "өзгерісті температура", "энергетикалық температура", "Жер температурасы",
        "кинетикалық температура"
    ],
    "correct": ["кинетикалық температура"]
},
{
    "question": "Клапейрон – Менделеев теңдеуімен сипатталмайтын газ",
    "options": [
        "модельденген газ", "өзара әрекет ескерілмейтін газ", "нақты және идеал газ",
        "шынайы газ", "нақты газ", "идеал газ"
    ],
    "correct": ["нақты газ", "шынайы газ"]
},
{
    "question": "Тепе-теңдік күйде бірінен кейін бірі орындалатын идеалданған процестерде кеңінен қолданылатын термодинамикалық теориялық әдістер",
    "options": [
        "квази статистикалық", "кинематикалық әдіс", "динамикалық әдіс",
        "кванттық теле-тепе", "молекулалық", "квази теле-тепе"
    ],
    "correct": ["квази статистикалық"]
},
{
    "question": "Клапейрон-Клаузиус теңдеуі",
    "latex": r"\frac{dP}{dT} = \frac{q_{12}}{T(\vartheta_2 - \vartheta_1)}",
    "options": [
        "dP/dT = q12 / T(θ2 − θ1)",
        "dR/dT = q12 / T(θ2 − θ1)",
        "dT/dT = q12 / T(θ1θ2)",
        "dV/dT = q12 / T(θ2 + θ1)",
        "dP/dT = q12 / T(θ2 + θ1)",
        "dP/dT = q12 / T(θ2 × θ1)"
    ],
    "correct": ["dP/dT = q12 / T(θ2 − θ1)"]
},
{
    "question": "Диффузия коэффициенті мен бөлшектердің қозғалысы арасындағы байланысты көрсететін Эйнштейн формуласы",
    "options": [
        "D = k − TB", "D = k − T − B", "D = kTB",
        "D = kT − B", "D = k + T − B", "D = k + TB", "D = k + T + B"
    ],
    "correct": ["D = kT − B"]
},
{
    "question": "Тартыс өрісі біртекті изотермиялық (T температуралы) жағдайда Жер атмосферасындағы газ молекуласының орташа потенциалдық энергиясын есептеу",
    "options": [
        "⟨εₚ⟩ = 2RkT", "c = cᵥ", "c = c₀", "⟨εₚ⟩ = 3RT",
        "⟨εₚ⟩ = 3RkT", "⟨εₚ⟩ = kT", "c = cₚ"
    ],
    "correct": ["⟨εₚ⟩ = 3RT"]
},
{
    "question": "Атмосфералық құрал",
    "options": [
        "секундомер", "градусник", "Паскаль шары", "Джоуль ыдысы",
        "мұздатқыш", "сағат", "термос", "динамометр"
    ],
    "correct": ["Паскаль шары"]
},
{
    "question": "Егер толқын ұзындығы 7 м, ал тербеліс жиілігі 220 Гц болса, онда дыбыс толқынының суда 7,7 км қашықтықты жүріп өту уақыты",
    "options": ["12,5 с", "15 с", "5 с", "7,5 с", "10 с"],
    "correct": ["5 с"]
},
{
    "question": "Гармоникалық тербелістер жасайтын материалдық нүктенің толық энергиясы",
    "latex": r"E = \frac{mA^2 \omega_0^2}{2}",
    "options": [
        r"E = \frac{mA^2 \omega_0^2}{2} \sin^2(\omega_0 t + \varphi)",
        r"E = \frac{mA^2 \omega_0^2}{2}",
        r"E = \frac{mA^2 \omega_0^2}{2} \cos^2(\omega_0 t + \varphi)",
        r"E = \frac{m \omega_0^2 x^2}{2}",
        r"E = \frac{mA^2 \omega_0^2}{2}"
    ],
    "correct": [r"E = \frac{mA^2 \omega_0^2}{2}"]
},
{
    "question": "Тербелістегі нүктенің ығысуы келесі x = A cos(ω₀t + φ) заңдылығымен өзгерсе, онда нүктенің жылдамдығы",
    "latex": r"x = A \cos(\omega_0 t + \varphi)",
    "options": [
        r"v = A\omega_0 \cos(\omega_0 t + \varphi)",
        r"v = -A\omega_0 \sin(\omega_0 t + \varphi)",
        r"v = -A\omega_0^2 \cos(\omega_0 t + \varphi)",
        r"v = -A\omega_0 \sin(\omega_0 t + \varphi)",
        r"v = A\omega_0 \sin(\omega_0 t + \varphi)"
    ],
    "correct": [r"v = -A\omega_0 \sin(\omega_0 t + \varphi)"]
},
{
    "question": "Сұйық қысымы әртүрлі құбырмен ағады. Қысымның минимал болатын құбырдың қимасы",
    "options": [
        "ағыс жылдамдығы төмен болатын қимада",
        "минималды болмайды, бірдей болады",
        "қимасы ең үлкен жерде",
        "қималарына тәуелді емес",
        "қимасы ең аз жерде"
    ],
    "correct": ["қимасы ең аз жерде"]
},
{
    "question": "Бернулли теңдеуінің тұжырымдамасы",
    "options": [
        "стационар емес ағыс үшін динамикалық қысыммен анықталады",
        "стационар ағысы үшін механикалық энергияның сақталу заңы",
        "стационар ағысы үшін статикалық қысыммен анықталады",
        "стационар ағысы үшін динамикалық қысыммен анықталады",
        "стационар емес ағыс үшін энергияның сақталу заңы"
    ],
    "correct": ["стационар ағысы үшін механикалық энергияның сақталу заңы"]
},
{
    "question": "Ағын дегеніміз",
    "options": [
        "сұйықтың ток сызықтарымен шектелген бөлігі",
        "әрбір нүктесінде жанама болатын сызық",
        "сұйықтың қозғалысы",
        "қозғалисттағы сұйықтың бөлшектерінің жиынтығы",
        "бөлшектердің қозғалысы"
    ],
    "correct": ["сұйықтың ток сызықтарымен шектелген бөлігі"]
},
{
    "question": "Сығымбайтын сұйық үшін үзіліссіздік теңдеуі",
    "options": [
        r"\frac{S_1}{S_2} = \frac{v_2}{v_1}",
        r"S_1v_2 = S_2v_1",
        r"Sv = const",
        r"\rho_1 v_1 = \rho_2 v_2",
        r"\rho v = const"
    ],
    "correct": [r"S_1v_2 = S_2v_1"]
},
{
    "question": "Инерция күштері",
    "options": [
        "санақ жүйесінің үдемелі қозғалысынан туатын күштер",
        "санақ жүйесінің тек ілгерілемелі қозғалысынан туатын инерция күштері",
        "периаралық санақ жүйесіндегі күштер",
        "санақ жүйесінің бұралмалы қозғалысынан туатын күштер",
        "кез келген санақ жүйесіндегі күштер"
    ],
    "correct": ["санақ жүйесінің үдемелі қозғалысынан туатын күштер"]
},
{
    "question": "Күштер әрекет еткен гироскоптық прецессияның бұрыштық жылдамдығы",
    "options": [
        r"\Omega = \frac{M}{L}", r"\Omega = \frac{p}{F}", r"\Omega = \frac{L}{M}",
        r"\Omega = \frac{F}{p}", r"\Omega = \frac{I \omega}{M}"
    ],
    "correct": [r"\Omega = \frac{M}{L}"]
},
{
    "question": "Инерциялық емес санақ жүйесі",
    "options": [
        "инерциялық емес санақ жүйесіне қатысты қозғалатын санақ жүйесі",
        "инерциялық санақ жүйесіне қатыссыз үдеумен қозғалатын санақ жүйесі",
        "инерциялық санақ жүйесіне қатысты үдеумен қозғалатын санақ денесі",
        "инерциялық санақ жүйесіне қатысты жылдамдықпен қозғалатын санақ жүйесі",
        "инерциялық санақ жүйесіне қатысты үдеумен қозғалатын санақ жүйесі"
    ],
    "correct": ["инерциялық санақ жүйесіне қатысты үдеумен қозғалатын санақ жүйесі"]
},
{
    "question": "Тартылыс өрісінің көрінуі",
    "options": [
        "инертілік сипаттама", "күштік сипаттама", "күш сызықтары",
        "энергетикалық сипаттама", "қозғалыс мәндері"
    ],
    "correct": ["күш сызықтары"]
},
{
    "question": "Инерция моменті 0,4 кг·м² тұтас диск 2 рад/с бұрыштық жылдамдықпен айналады. Дискінің импульс моменті",
    "options": [
        "1,2 кг·м²/с", "1,6 кг·м²/с", "0,8 кг·м²/с",
        "0,2 кг·м²/с", "0,4 кг·м²/с"
    ],
    "correct": ["0,8 кг·м²/с"]
},
{
    "question": "Радиусы R жұқа дөңгелек сақинаның инерция моменті",
    "options": [
        r"I = \frac{1}{12} mR^2", r"I = \frac{1}{2} mR^2", r"I = \frac{1}{3} mR^2",
        r"I = \frac{1}{2} mR", r"I = mR^2"
    ],
    "correct": [r"I = mR^2"]
},
{
    "question": "Әске қатысты материалдық нүктелер жүйесінің инерция моменті",
    "options": [
        r"I = \sum_{i=1}^{n} m_i r_i", r"L = \sum_{i=1}^{n} m_i r_i^2",
        r"I = \sum_{i=1}^{n} m_i r_i^2", r"I = \int r^2 dm", r"I = \sum m_i v_i^2"
    ],
    "correct": [r"I = \sum_{i=1}^{n} m_i r_i^2"]
},
{
    "question": "Өріс күші мен потенциалдық энергия арасындағы байланыс өрнегі",
    "options": [
        r"\vec{F} = -\left(\frac{dU}{dx} \hat{i} + \frac{dU}{dy} \hat{j} + \frac{dU}{dz} \hat{k} \right)",
        r"\vec{F} = \left(\frac{dU}{dx} \hat{i} + \frac{dU}{dy} \hat{j} + \frac{dU}{dz} \hat{k} \right)",
        r"\vec{F} = \left(\frac{aU}{dx} \hat{i} + \frac{dU}{dy} \hat{j} + \frac{dU}{dz} \hat{k} \right)",
        r"\vec{F} = \left(\frac{dU}{dx} \hat{i} + \frac{dU}{dy} \hat{j} + \frac{dU}{dz} \hat{k} \right)",
        r"\vec{F} = \left(\frac{dU}{dx} \hat{i} + \frac{dU}{dy} \hat{j} + \frac{dU}{dz} \hat{k} \right)"
    ],
    "correct": [r"\vec{F} = -\left(\frac{dU}{dx} \hat{i} + \frac{dU}{dy} \hat{j} + \frac{dU}{dz} \hat{k} \right)"]
},
{
    "question": "Күштің t уақыт аралығындағы атқаратын жұмысы",
    "options": [
        r"A = \int_0^t N dt", r"A = -\int_0^t N dt", r"A = \int_0^t N dt",
        r"A = \int_0^t N dt", r"A = \int F dt"
    ],
    "correct": [r"A = \int_0^t N dt"]
},
{
    "question": "Массасы 1000 кг автомобильдің 20 м/с жылдамдығын 30 м/с жылдамдыққа дейін жеткізу үшін жұмыс атқарылады",
    "options": [
        r"2{,}5 \cdot 10^5 Дж", r"2{,}5 \cdot 10^5 Дж", r"5 \cdot 10^3 Дж",
        r"5 \cdot 10^5 Дж", r"5 \cdot 10^3 Дж"
    ],
    "correct": [r"2{,}5 \cdot 10^5 Дж"]
},
{
    "question": "Массасы 15 кг жүк биіктігі 10 м болатын төбешікке көтерілу үшін атқарылатын жұмыс",
    "options": [
        r"14{,}7 \cdot 10^2 Дж", r"0{,}147 \cdot 10^3 Дж", r"14{,}7 Дж",
        r"147 Дж", r"1470 Дж"
    ],
    "correct": ["1470 Дж"]
},
{
    "question": "Импульстің сақталу заңы",
    "options": [
        r"L = const", r"\vec{dp} = const", r"\vec{p} = const",
        r"dL = const", r"\vec{L} = const"
    ],
    "correct": [r"\vec{p} = const"]
},
{
    "question": "Жүйенің импульсі",
    "options": [
        "ішкі күштердің әсерінен ғана өзгерте алады",
        "сыртқы күштердің әсерінен ғана өзгерте алады",
        "күштер әсерінсіз өзгерте алады",
        "сыртқы күштердің әсерінен ғана өзгерте алмайды",
        "сыртқы және ішкі күштердің әсерінен ғана өзгерте алады"
    ],
    "correct": ["сыртқы күштердің әсерінен ғана өзгерте алады"]
},
{
    "question": "Импульстің сақталу заңы (формуламен)",
    "options": [
        r"m_1 v_1 + m_2 v_2 = m_1 v_1' + m_2 v_2'",
        r"m_1 \vec{v}_1 + m_2 \vec{v}_2 = m_1 \vec{v}_1' + m_2 \vec{v}_2'",
        r"m_1 v_1 + m_2 v_2 = m_1 v_2' + m_2 v_1'",
        r"m_1 \vec{v}_1 + m_2 \vec{v}_1' = m_2 \vec{v}_2",
        r"m_1 \vec{v}_1' + m_2 \vec{v}_2' = m_1 \vec{v}_2 + m_2 \vec{v}_1"
    ],
    "correct": [r"m_1 \vec{v}_1 + m_2 \vec{v}_2 = m_1 \vec{v}_1' + m_2 \vec{v}_2'"]
},
{
    "question": "Ашық жүйе үшін импульстің сақталу заңы орындалатын шарт",
    "options": [
        "сыртқы күштер белгілі бір бағытта әрекет жасайды",
        "сыртқы күштер қосындысы нөлге тең",
        "ішкі күштер тұрақты",
        "сыртқы күштер мен ішкі күштер тұрақты",
        "сыртқы күштер тұрақты"
    ],
    "correct": ["сыртқы күштер қосындысы нөлге тең"]
},
{
    "question": "Қозғалмай тұрған массасы m дене тұрақты күш әсерінен үдемелі қозғалысқа келіп, S жол жүргенде, жылдамдығы V болған. Бұл күштің қуаты",
    "options": [
        r"N = \frac{mv^3}{2S^2}", r"N = \frac{mv^2}{2S}", r"N = \frac{mv^3}{4S}",
        r"N = \frac{mv}{2S}", r"N = \frac{mv^2}{2S^2}"
    ],
    "correct": [r"N = \frac{mv^3}{2S^2}"]
},
{
    "question": "Күш импульсінің өрнегі",
    "options": [
        r"\vec{p}_2 - \vec{p}_1 = \int_0^t \vec{F} dt",
        r"\vec{p}_2 - \vec{p}_1 = \int_0^t F dt",
        r"\vec{p}_2 - \vec{p}_1 = \int_0^t Ft dt",
        r"\vec{p}_2 = \int_0^t \vec{F} dt",
        r"p_2 - p_1 = \int \vec{F} dt"
    ],
    "correct": [r"\vec{p}_2 - \vec{p}_1 = \int_0^t \vec{F} dt"]
},
{
    "question": "Материалдық нүктелер жүйесінің массалар центрі C нүктесінің радиус-векторы",
    "options": [
        r"\vec{r}_C = \frac{1}{m} \sum_{i=1}^n m_i \vec{r}_i",
        r"\vec{r}_C = \frac{1}{m_i} \sum_{i=1}^n m_i \vec{r}_i",
        r"\vec{r}_C = \frac{1}{m} \sum_{i=1}^n m_i r_i^2",
        r"\vec{r}_C = \frac{1}{m} \sum_{i=1}^n m r_i",
        r"\vec{r}_C = \frac{1}{n} \sum_{i=1}^n m_i \vec{r}_i"
    ],
    "correct": [r"\vec{r}_C = \frac{1}{m} \sum_{i=1}^n m_i \vec{r}_i"]
},
{
    "question": "Электромагниттік әсерге жататын күш",
    "options": [
        "бүкіләлемдік тартылыс күші", "үйкеліс күші", "тұтқырлық күші",
        "гравитациялық күш", "нейтрондардың өзара әсер күші"
    ],
    "correct": ["тұтқырлық күші"]
},
{
    "question": "0,05 рад/с бұрыштық жылдамдықпен айналып тұрған карусельде бала отыр. Баланың айналыс осінен қашықтығы 10 м. Баланың сызықтық жылдамдығының модулі",
    "options": [
        r"5 \cdot 10^{-2} м/с", r"0,05 м/с", r"200 м/с", r"0,5 м/с", r"0,005 м/с"
    ],
    "correct": [r"0,5 м/с"]
},
{
    "question": "Айналмалы қозғалыс кезіндегі бұрыштық жылдамдық өрнегі",
    "options": [
        r"\vec{\omega} = \frac{d\varphi}{dt}", r"\omega = \frac{d\varphi}{dt}",
        r"\omega = \frac{d\varphi}{dt}", r"\omega = \frac{d^2 \varphi}{dt}", r"\vec{\omega} = \frac{d\varphi}{dt}"
    ],
    "correct": [r"\omega = \frac{d\varphi}{dt}"]
}


]

# ---------------------------
# Streamlit Web App
# ---------------------------
st.title("30.07 - уже тапсырамыз так что оқы оқы және оқы.")

if "selected" not in st.session_state:
    st.session_state.selected = random.sample(questions, 10)

user_answers = {}

with st.form("quiz"):
    for i, q in enumerate(st.session_state.selected, 1):
        st.subheader(f"{i}. {q['question']}")
        if "latex" in q:
            st.latex(q["latex"])

        user_answers[i] = st.multiselect("Выберите ответ(ы):", q["options"], key=f"q{i}")

    submitted = st.form_submit_button("Проверить")

# ---------------------------
# Проверка результатов
# ---------------------------
if submitted:
    score = 0
    st.markdown("---")
    st.subheader("📊 Результаты:")

    for i, q in enumerate(st.session_state.selected, 1):
        correct_set = set(q["correct"])
        user_set = set(user_answers[i])

        if user_set == correct_set:
            st.success(f"{i}. ✅ Ахххх ты черт ты прав ")
            score += 1
        else:
            st.error(f"{i}. ❌ Черт,ты теперь и  лох")
            st.markdown(f"Правильный ответ: **{', '.join(correct_set)}**")

    st.markdown(f"### ✅ Итог: {score} из {len(st.session_state.selected)}")
